Revit 2027 API
ColorFillLegend.ColorFillCategoryId Property
 Returns the id of color fill category that this legend is created for.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ColorFillCategoryId { get; }
Public ReadOnly Property ColorFillCategoryId As ElementId
	Get
public:
property ElementId^ ColorFillCategoryId {
	ElementId^ get ();
}
member ColorFillCategoryId : ElementId with get
Property Value
ElementId
See Also
Reference
ColorFillLegend Class
Autodesk.Revit.DB Namespace